app/views/admin/order/show.html.erb

<h2>Detalles del pedido</h2>
<% for item in @order.order_items %>
---
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 6