app/controllers/admin/director_controller.rb

  def create
    @director = Director.new(director_params)
    if @director.save
---
INSERT INTO `directors` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Patricio', 'Fernandez', '2018-04-09 11:22:21', '2018-04-09 11:22:21')

  def edit
    @director = Director.find(params[:id])
---
SELECT  `directors`.* FROM `directors` WHERE `directors`.`id` = 4 LIMIT 1

  def update
    @director = Director.find(params[:id])
    if @director.update_attributes(director_params)
---
SELECT  `directors`.* FROM `directors` WHERE `directors`.`id` = 4 LIMIT 1
UPDATE `directors` SET `first_name` = 'Cristopher', `last_name` = 'Nolan', `updated_at` = '2018-04-23 10:38:13' WHERE `directors`.`id` = 1

  def destroy
    @director = Director.find(params[:id])
    @director.destroy
---
SELECT  `directors`.* FROM `directors` WHERE `directors`.`id` = 1 LIMIT 1
DELETE FROM `directors` WHERE `directors`.`id` = 1

  def show
    @director = Director.find(params[:id])
---
SELECT  `directors`.* FROM `directors` WHERE `directors`.`id` = 4 LIMIT 1

  def index
    @directors = Director.all
---
SELECT `directors`.* FROM `directors`