app/controllers/admin/movie_controller.rb

INSERT INTO `movies` (`title`, `producer_id`, `serial_number`, `blurb`, `price`, `length`, `cover_image_file_name`, `cover_image_content_type`, `cover_image_file_size`, `cover_image_updated_at`, `produced_at`, `created_at`, `updated_at`) VALUES ('Interstellar', 1, '43211', 'Una película es una obra de arte cinematográfica, la cual narra de una manera visual y auditiva, una historia o un hecho. La forma en que se proyecta esta imagen es por medio de una secuencia de imágenes, que en un inicio se proyectaba sin sonido, en lo que hoy se conoce como cine mudo, pero que años más tarde dio paso al cine sonoro, lo que significó un aporte de suma importancia para la industria cinematográfica. Por lo general una película se basa en un guion, en la que los personajes pueden o no ser interpretados por actores. No se distingue el material sensible en el que se han impreso las imágenes ni tampoco el medio en el que se reproduce, como podría serlo una sala de cine, un televisor o una computadora.\r\n\r\n', 42.0, 32, 'interstellar-366875261-large.jpg', 'image/jpeg', 167430, '2018-04-23 10:41:36', '2017-03-23 10:40:00', '2018-04-23 10:41:36', '2018-04-23 10:41:36')
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
    def edit
    load_data
    @movie = Movie.find(params[:id])

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
UPDATE `movies` SET `cover_image_file_name` = 'clapperboard_cinema_icon-icons.com_66131.png', `cover_image_content_type` = 'image/png', `cover_image_file_size` = 16058, `cover_image_updated_at` = '2018-04-23 10:41:47', `updated_at` = '2018-04-23 10:41:47' WHERE `movies`.`id` = 1
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
DELETE FROM `movies` WHERE `movies`.`id` = 1
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
  def show
    @movie = Movie.find(params[:id])

SELECT  `movies`.* FROM `movies`  ORDER BY producer_id LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `movies`
---
  def index
    sort_by = params[:sort_by]
    @movies = Movie.order(sort_by).paginate(:page => params[:page], :per_page => 5)

SELECT `directors`.* FROM `directors`
SELECT `producers`.* FROM `producers`
---
    def load_data
      @directors = Director.all
      @producers = Producer.all