app/controllers/admin/movie_controller.rb

INSERT INTO `movies` (`title`, `producer_id`, `produced_at`, `serial_number`, `blurb`, `price`, `length`, `created_at`, `updated_at`) VALUES ('A new Movie of Ruby', 61, '2018-04-26 11:08:09', '64214', 'A new Movie of Ruby', 45.5, 325, '2018-04-26 11:08:09', '2018-04-26 11:08:09')
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

UPDATE `movies` SET `title` = 'A very new Movie of Ruby', `produced_at` = '2018-04-26 11:08:36', `serial_number` = '43214', `blurb` = 'A very new Movie of Ruby', `price` = 50.0, `length` = 350, `updated_at` = '2018-04-26 11:08:36' WHERE `movies`.`id` = 108
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)

SELECT `directors`.* FROM `directors`
SELECT `producers`.* FROM `producers`
---
    def load_data
      @directors = Director.all
      @producers = Producer.all