app/controllers/admin/order_controller.rb

  def close
    order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1

  def show
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 6 LIMIT 1

  def index
    @status = params[:id]
    if @status.blank?
      @status = 'all'
      conditions = nil
    else
      conditions = "status = '#{@status}'"
    end

    case @status
    when 'all'
      @status = 'todo'
    when "open"
      @status = 'abierto'
    when "processed"
      @status = 'procesado'
    when "closed"
      @status = 'cerrado'
    when "failure"
      @status = 'fallado'
    end
    @orders = Order.where(conditions).paginate(:page => params[:page], :per_page => 10)
---
SELECT  `orders`.* FROM `orders` WHERE (status = 'open') LIMIT 10 OFFSET 0