app/controllers/admin/producer_controller.rb

INSERT INTO `producers` (`name`, `created_at`, `updated_at`) VALUES ('Pixar', '2018-04-02 11:06:16', '2018-04-02 11:06:16')
---
  def create
    @producer = Producer.new(producer_params)
    if @producer.save

SELECT  `producers`.* FROM `producers` WHERE `producers`.`id` = 2 LIMIT 1
---
  def edit
    @producer = Producer.find(params[:id])

SELECT  `producers`.* FROM `producers` WHERE `producers`.`id` = NULL LIMIT 1
UPDATE `producers` SET `name` = 'Pixara', `updated_at` = '2018-04-02 11:07:39' WHERE `producers`.`id` = 2
---
  def update
    @producer = Producer.find(params[:id])
    if @producer.update_attributes(producer_params)

SELECT  `producers`.* FROM `producers` WHERE `producers`.`id` = 2 LIMIT 1
DELETE FROM `producers` WHERE `producers`.`id` = 2
---
  def destroy
    @producer = Producer.find(params[:id])
    @producer.destroy

SELECT  `producers`.* FROM `producers` WHERE `producers`.`id` = 1 LIMIT 1
---
  def show
    @producer = Producer.find(params[:id])

SELECT `producers`.* FROM `producers`
---
  def index
    @producers = Producer.all