app/views/admin/movie/_form.html.erb

  <p><label for="movie[director_ids][]">Directors</label><br/>
  <%= select_tag 'movie[director_ids][]', options_from_collection_for_select(@directors, :id, :name,
      @movie.directors.collect{|director| director.id}), { :multiple => true, :size => 5 } %></p>
---
SELECT `directors`.* FROM `directors` INNER JOIN `directors_movies` ON `directors`.`id` = `directors_movies`.`director_id` WHERE `directors_movies`.`movie_id` = 1