app/controllers/cart_controller.rb

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 7 LIMIT 1
---
  def add
    @movie = Movie.find params[:id]

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 4 LIMIT 1
---
  def remove
    @movie = Movie.find params[:id]

DELETE FROM `cart_items` WHERE `cart_items`.`id` = 1
---
  def clear
    @page_title = 'Clear cart'
    if request.post?
      @cart.cart_items.destroy_all