app/controllers/catalog_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 7 LIMIT 1

  def index
    @movies = Movie.order("movies.id desc").includes(:directors, :producer).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `movies`.* FROM `movies`  ORDER BY movies.id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `movies`
SELECT `directors`.* FROM `directors` WHERE `directors`.`id` IN (1, 5, 3, 2)
SELECT `producers`.* FROM `producers` WHERE `producers`.`id` IN (1, 6, 5)