app/controllers/checkout_controller.rb

SELECT  1 AS one FROM `movies` INNER JOIN `cart_items` ON `movies`.`id` = `cart_items`.`movie_id` WHERE `cart_items`.`cart_id` = 2 LIMIT 1
---
  def index
    @order = Order.new
    @page_title = 'Facturación'
    if @cart.movies.empty?

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 2 LIMIT 1
INSERT INTO `orders` (`email`, `phone_number`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_address`, `ship_to_city`, `ship_to_postal_code`, `ship_to_country_code`, `customer_ip`, `status`, `created_at`, `updated_at`) VALUES ('patricio.fernandez.florez@gmail.com', '677792598', 'Patricio', 'Fernández Flórez', 'Green Sight', 'Sevilla', '11100', 'VC', '127.0.0.1', 'open', '2018-05-07 11:13:59', '2018-05-07 11:13:59')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 15
---
  def submit_order
    @cart = Cart.find(params[:cart][:id]) # Search the cart from the cart id hidden field of the form
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = 'Facturación'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Su compra ha sido enviada con exito.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart